In [1]:
import pandas as pd

In [2]:
df_data = pd.read_excel('data_ori.xlsx',index_col=[0])

In [5]:
df_data['INCUR_DATE_FROM']
df_data['ORG_PRES_AMT']

0            RMB 15
1        RMB 493.95
2          RMB 49.8
3           RMB 140
4           RMB 100
            ...
77074    RMB 174.74
77075        RMB 16
77076       RMB 130
77077         RMB 0
77078    RMB 120.01
Name: ORG_PRES_AMT, Length: 77079, dtype: object

In [7]:
nw = []
for idx,row in df_data.iterrows():
    ti=(str(row['INCUR_DATE_FROM']).split(' ')[0])
    tmp=str(row['ORG_PRES_AMT']).split(' ')

    mon=float(tmp[1])
    if(mon<0):
        print(row['ORG_PRES_AMT'],mon)
    if tmp[0]=='USD':
        mon*=7.1456
    tmp={'time':ti,'money':mon}
    s = pd.Series(tmp)
    nw.append(s)
nw_df = pd.DataFrame(nw)
nw_df

RMB -.6 -0.6
RMB -320.82 -320.82

             time   money
0      2018-05-01   15.00
1      2018-05-01  493.95
2      2018-05-01   49.80
3      2018-05-01  140.00
4      2018-05-01  100.00
...           ...     ...
77074  2018-05-30  174.74
77075  2018-05-30   16.00
77076  2018-05-30  130.00
77077  2018-05-30    0.00
77078  2018-05-30  120.01

[77079 rows x 2 columns]

In [9]:
nw_df.to_csv('flow_data.csv')